Revit 2026 API

# ComboBoxAddSeparator Method

---

Adds a separator to the drop-down list.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddSeparator()
```
```vb
Public Sub AddSeparator
```
```cpp
public:
void AddSeparator()
```
```fsharp
member AddSeparator : unit -> unit
```

The separator will be added below the last added member.

#### Reference

ComboBox Class

Autodesk.Revit.UI Namespace